#+TITLE: bacalau.org, septembre 2023
#+STARTUP: content
#+OPTIONS: toc:nil num:nil

* company
https://github.com/pprevos/emacs-config/blob/main/emacs-configuration.org
#+begin_src emacs-lisp
  (use-package company
    :demand t
    ;;:bind (:map company-active-map ("<tab>" . company-complete-selection))
    :custom
    (company-idle-delay 0)
    (company-minimum-prefix-length 2)
    (company-selection-wrap-around t)
    (company-tng-configure-default) ;; mouvement avec la touche tab
  )

  (setq company-dabbred-downcase nil)

  (add-hook 'after-init-hook 'global-company-mode)
#+end_src

#+begin_src emacs-lisp
  ;; (use-package company
  ;;   :config
  ;;   (setq company-idle-delay 0
  ;;         company-minimum-prefix-length 2
  ;;         company-selection-wrap-around t))

  ;; (global-company-mode)

  (use-package company-posframe
    :config
    (company-posframe-mode 1))
#+end_src

https://github.com/hrs/dotfiles/blob/main/emacs/.config/emacs/configuration.org
#+begin_src emacs-lisp
  ;; (use-package company
  ;; :demand t
  ;; :hook (prog-mode . company-mode)
  ;; :bind (:map company-active-map
  ;;             ("<tab>" . company-complete-selection))

  ;; :custom
  ;; (company-backends '((company-capf company-dabbrev-code)))
  ;; (company-idle-delay 0.2)
  ;; (company-minimum-prefix-length 3)
  ;; (company-tooltip-align-annotations t)
  ;; (company-tooltip-limit 20)

  ;; :config
  ;; (setq lsp-completion-provider :capf))
#+end_src

https://github.com/iquiw/company-restclient
#+begin_src emacs-lisp
(use-package company-restclient)
(add-to-list 'company-backends 'company-restclient)
#+end_src

#+RESULTS:
| company-restclient | company-bbdb | company-semantic | company-cmake | company-capf | company-clang | company-files | (company-dabbrev-code company-gtags company-etags company-keywords) | company-oddmuse | company-dabbrev |

** Langages
#+begin_src emacs-lisp
  (org-babel-do-load-languages 'org-babel-load-languages
                                   '(
                                         (C . t)
                                         (R . t)
                                         (awk . t)
                                         (clojure    . t)
                                         (dot . t)
                                         (haskell   . t)
					 (gnuplot . t)
                                         (java  . t)
                                         (js     . t)
                                         (jupyter . t)
                                         (latex . t)
                                         (lilypond . t)
                                         (lisp   . t)
                                         (perl . t)
                                         (php . t)
                                         (plantuml . t)
                                         (prolog . t)
                                         (python . t)
                                         (restclient . t)
                                         (ruby . t)
                                         (scheme . t)
                                         (shell  . t)
                                         (sql    . t)
					     (sqlite . t)
                                         ;;(csharp . t)
                                         ;;(ein    . t)
                                         ;;(scala . t)
                                         ))
  (setq org-confirm-babel-evaluate nil)
  ;; https://sachachua.com/dotemacs => Diagrams and graphics
  (add-to-list 'org-src-lang-modes '("dot" . graphviz-dot))
#+end_src

#+RESULTS:
: ((jupyter-python . python) (dot . graphviz-dot) (php . php) (C . c) (C++ . c++) (asymptote . asy) (bash . sh) (beamer . latex) (calc . fundamental) (cpp . c++) (ditaa . artist) (desktop . conf-desktop) (dot . fundamental) (elisp . emacs-lisp) (ocaml . tuareg) (screen . shell-script) (shell . sh) (sqlite . sql) (toml . conf-toml))

* code-cells : notebooks
https://github.com/astoff/code-cells.el
#+begin_src emacs-lisp
(add-hook 'python-mode-hook 'code-cells-mode-maybe)
#+end_src

#+begin_src emacs-lisp
(setq code-cells-convert-ipynb-style '(("pandoc" "--to" "ipynb" "--from" "org")
                                       ("pandoc" "--to" "org" "--from" "ipynb")
                                       (lambda () #'org-mode)))
#+end_src

#+RESULTS:
| pandoc | --to | ipynb      | --from | org   |
| pandoc | --to | org        | --from | ipynb |
| lambda | nil  | #'org-mode |        |       |

